[Marksman X2SoldierClassTemplate]
+DisplayName="Marksman"
+ClassSummary="A Marksman utilizies snapshot sniping combined with throwing knives to engage enemies at mid to short range allowing for devastating flanks, area control, and close quarters knife fighting"
+LeftAbilityTreeTitle="Marksman"
+RightAbilityTreeTitle="Juggler"
AbilityTreeTitles[0]="Marksman"
AbilityTreeTitles[1]="Controller"
AbilityTreeTitles[2]="Juggler"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

+RandomNickNames[0]="Juggler"
+RandomNickNames[1]="Deadeye"
+RandomNickNames[2]="One Shot"
+RandomNickNames[3]="Assassin"
+RandomNickNames[4]="Agent"
+RandomNickNames[5]="Hidden Blade"
+RandomNickNames[6]="Roughrider"


